;========================================================
;				 Вектор прерываний
;========================================================		

	rjmp	init	; Переход на начало программы
	rjmp	_INT0_or_1	; Внешнее прерывание 0
	rjmp	_INT0_or_1	; Внешнее прерывание 1
	reti			; Прерывание по захвату таймера T1
	rjmp 	_TIM1_A	; Прерывание по совпадению T1 A
	reti			; Прерывание по переполнению T1
	reti			; Прерывание по переполнению T0
	reti			; Прерывание UART прием завершен
	reti			; Прерывание UART регистр данных пуст
	reti			; Прерывание UART передача завершена
	reti			; Прерывание по компаратору
	reti			; Прерывание по изменению на любом контакте
	reti			; Таймер/счетчик 1. Совпадение B 
	rjmp 	_TIM0	; Таймер/счетчик 0. Совпадение A
	reti			; Таймер/счетчик 0. Совпадение B 
	reti			; USI Стартовая готовность
	reti			; USI Переполнение
	reti			; EEPROM Готовность
	reti			; Переполнение охранного таймера